test/tests/multiapps/unsteady_heat_conduction_in_infinite_system/fluid-openfoam/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       1;
    }
    thermodynamics
    {
        Cp              16;        // Specific heat capacity [J/(kg·K)]
        Hf              0;         // Heat of formation [J/kg]
    }
    transport
    {
        kappa           4;         // Thermal conductivity [W/(m·K)]
        mu              1e-3;      // Dynamic viscosity [Pa·s]
    }
    equationOfState
    {
        rho             1;         // Density [kg/m^3]
    }
}


// ************************************************************************* //
